In [1]:
import warnings
warnings.filterwarnings("ignore")

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from env import user, password, host

In [2]:
def get_connection(db, user=user, host=host, password=password):
    '''
    This function uses my info from my env file to
    create a connection url to access the Codeup db.
    '''
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

In [3]:
def new_zillow_data():
    '''
    This function reads in the Zillow data from the Codeup db
    and returns a pandas DataFrame with selected columns.
    '''
    sql_query = '''
                select 
                bedroomcnt, bathroomcnt, calculatedfinishedsquarefeet, taxvaluedollarcnt, yearbuilt, taxamount, fips
                from properties_2017
                join propertylandusetype using (propertylandusetypeid)
                where propertylandusedesc = "Single Family Residential"
                '''
    
    return pd.read_sql(sql_query, get_connection('zillow'))

In [4]:
df = new_zillow_data()

In [5]:
df.head().T

                                    0       1       2        3          4
bedroomcnt                        0.0     0.0     0.0     0.00       4.00
bathroomcnt                       0.0     0.0     0.0     0.00       2.00
calculatedfinishedsquarefeet      NaN     NaN     NaN      NaN    3633.00
taxvaluedollarcnt             27516.0    10.0    10.0  2108.00  296425.00
yearbuilt                         NaN     NaN     NaN      NaN    2005.00
taxamount                         NaN     NaN     NaN   174.21    6941.39
fips                           6037.0  6037.0  6037.0  6037.00    6037.00

In [6]:
df.shape

(2152863, 7)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2152863 entries, 0 to 2152862
Data columns (total 7 columns):
 #   Column                        Dtype
---  ------                        -----
 0   bedroomcnt                    float64
 1   bathroomcnt                   float64
 2   calculatedfinishedsquarefeet  float64
 3   taxvaluedollarcnt             float64
 4   yearbuilt                     float64
 5   taxamount                     float64
 6   fips                          float64
dtypes: float64(7)
memory usage: 115.0 MB

In [12]:
df.isnull().sum()

bedroomcnt                        11
bathroomcnt                       11
calculatedfinishedsquarefeet    8484
taxvaluedollarcnt                493
yearbuilt                       9337
taxamount                       4442
fips                               0
dtype: int64

In [13]:
df.isnull().any()

bedroomcnt                       True
bathroomcnt                      True
calculatedfinishedsquarefeet     True
taxvaluedollarcnt                True
yearbuilt                        True
taxamount                        True
fips                            False
dtype: bool

In [15]:
df.describe()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
count,2.152852e+06,2.152852e+06,2.144379e+06,2.152370e+06,2.143526e+06,2.148421e+06,2.152863e+06
mean,3.287196e+00,2.230688e+00,1.862855e+03,4.618962e+05,1.960950e+03,5.634866e+03,6.048377e+03
std,9.547544e-01,9.992796e-01,1.222125e+03,6.996760e+05,2.216220e+01,8.178910e+03,2.043329e+01
min,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,1.801000e+03,1.850000e+00,6.037000e+03
25%,3.000000e+00,2.000000e+00,1.257000e+03,1.881702e+05,1.949000e+03,2.534980e+03,6.037000e+03
50%,3.000000e+00,2.000000e+00,1.623000e+03,3.276710e+05,1.958000e+03,4.108950e+03,6.037000e+03
75%,4.000000e+00,3.000000e+00,2.208000e+03,5.345270e+05,1.976000e+03,6.414320e+03,6.059000e+03
max,2.500000e+01,3.200000e+01,9.525760e+05,9.842891e+07,2.016000e+03,1.337756e+06,6.111000e+03

In [17]:
# Check out the values and their frequencies from in each column.

df.bedroomcnt.value_counts(dropna=False, ascending=True)

25.0         1
16.0         2
18.0         3
15.0         6
14.0         7
NaN         11
12.0        12
13.0        16
11.0        34
10.0       121
9.0        291
8.0       1107
7.0       4807
0.0      13187
1.0      23166
6.0      25166
5.0     150866
2.0     335473
4.0     634289
3.0     964298
Name: bedroomcnt, dtype: int64

In [19]:
df.bathroomcnt.value_counts(dropna=False, ascending=True)

19.00         1
32.00         1
19.50         1
14.50         1
12.50         3
11.50         3
1.75          3
17.00         4
20.00         6
18.00         8
NaN          11
16.00        12
10.50        14
0.50         16
15.00        17
14.00        25
13.00        39
9.50         50
12.00        73
8.50        110
11.00       146
10.00       325
7.50        384
9.00        713
6.50       1333
8.00       1692
7.00       4394
5.50       6217
6.00      10747
0.00      13027
4.50      19506
5.00      28362
3.50      28518
1.50      31211
4.00      82155
2.50     142981
1.00     414324
3.00     422841
2.00     943589
Name: bathroomcnt, dtype: int64

In [20]:
df.calculatedfinishedsquarefeet.value_counts(dropna=False, ascending=True)

24920.0       1
10127.0       1
35046.0       1
8803.0        1
16134.0       1
           ...
1400.0     3833
1120.0     4362
1080.0     4389
1200.0     5195
NaN        8484
Name: calculatedfinishedsquarefeet, Length: 10581, dtype: int64

In [21]:
df.taxvaluedollarcnt.value_counts(dropna=False, ascending=True)

27516.0        1
167020.0       1
145983.0       1
81898.0        1
1503486.0      1
            ...
440000.0     685
430000.0     690
400000.0     729
500000.0     779
450000.0     821
Name: taxvaluedollarcnt, Length: 592270, dtype: int64

In [23]:
df.yearbuilt.value_counts(dropna=False, ascending=True)

1874.0        1
1877.0        1
1862.0        1
1840.0        1
1807.0        1
          ...
1956.0    61942
1953.0    62342
1954.0    69163
1950.0    71693
1955.0    84405
Name: yearbuilt, Length: 154, dtype: int64

In [24]:
df.taxamount.value_counts(dropna=False, ascending=True)

3425.69       1
5555.02       1
4921.21       1
871.75        1
3475.45       1
           ...
285.30       67
343.52       75
344.18       77
345.72      172
NaN        4442
Name: taxamount, Length: 918839, dtype: int64

In [26]:
df = df.dropna()

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2140235 entries, 4 to 2152862
Data columns (total 7 columns):
 #   Column                        Dtype
---  ------                        -----
 0   bedroomcnt                    float64
 1   bathroomcnt                   float64
 2   calculatedfinishedsquarefeet  float64
 3   taxvaluedollarcnt             float64
 4   yearbuilt                     float64
 5   taxamount                     float64
 6   fips                          float64
dtypes: float64(7)
memory usage: 130.6 MB

In [28]:
df.isnull().sum()

bedroomcnt                      0
bathroomcnt                     0
calculatedfinishedsquarefeet    0
taxvaluedollarcnt               0
yearbuilt                       0
taxamount                       0
fips                            0
dtype: int64

In [29]:
df = df.rename(columns = {'bedroomcnt':'bedrooms', 
                          'bathroomcnt':'bathrooms', 
                          'calculatedfinishedsquarefeet':'area',
                          'taxvaluedollarcnt':'tax_value', 
                          'yearbuilt':'year_built'})

In [30]:
df.head()

    bedrooms  bathrooms    area  tax_value  year_built  taxamount    fips
4        4.0        2.0  3633.0   296425.0      2005.0    6941.39  6037.0
6        3.0        4.0  1620.0   847770.0      2011.0   10244.94  6037.0
7        3.0        2.0  2077.0   646760.0      1926.0    7924.68  6037.0
11       0.0        0.0  1200.0     5328.0      1972.0      91.60  6037.0
14       0.0        0.0   171.0     6920.0      1973.0     255.17  6037.0

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2140235 entries, 4 to 2152862
Data columns (total 7 columns):
 #   Column      Dtype
---  ------      -----
 0   bedrooms    float64
 1   bathrooms   float64
 2   area        float64
 3   tax_value   float64
 4   year_built  float64
 5   taxamount   float64
 6   fips        float64
dtypes: float64(7)
memory usage: 130.6 MB

In [32]:
df.isnull().sum()

bedrooms      0
bathrooms     0
area          0
tax_value     0
year_built    0
taxamount     0
fips          0
dtype: int64

In [33]:
df.value_counts()

bedrooms  bathrooms  area     tax_value  year_built  taxamount  fips
3.0       1.0        1002.0   39230.0    1962.0      419.14     6111.0    21
2.0       2.5        1008.0   101575.0   1988.0      1450.58    6059.0    16
4.0       3.0        2539.0   678000.0   2005.0      9094.20    6059.0    14
3.0       2.5        1358.0   194027.0   2000.0      2317.92    6111.0    14
                     2060.0   455635.0   2007.0      5271.34    6059.0    13
                                                                          ..
          2.0        1312.0   55069.0    1954.0      874.62     6059.0     1
                              54603.0    1963.0      857.48     6059.0     1
                              54300.0    1955.0      954.44     6037.0     1
                              54293.0    1956.0      947.47     6037.0     1
25.0      20.0       11700.0  1608491.0  2010.0      19238.87   6037.0     1
Length: 2130214, dtype: int64